// Suber Constructor هي انشاء دالة خاصة بالمتغيرات الموجودة في الكلاس 
// او نستخدم ال super  لاستدعاء ال Constructor الموجود في الكلاس الاب من داخل 
// الكلاس الابن حتى نمرر الية القيم التي نحتاجها لتهيئة الخصائص 
// وحتى نمرر المتغيرات نستخدم كلمة super بدل this عند عمل دلالة ال Constructor 
// للوصول الى متغيرات الكلاس الاب او الكلاس الذي نرث منه 
// كلمة this تعود على الكلاس نفسة متغيرات الكلاس نفسه اما super تعود 
// على متغيرات الكلاس الذي نرث منه 
// person(this.name, this.age);
// person(super.name, super.age);

//override هي ان تستخدم دالة ورثتها من الكلاس الاب لكن بطريقة استخدام اخرى 

// polymorphism هي ان كائنات مختلفة ترث كائن واحد وتستخدم الدوال الموجودة في هذا 
//الكائن بطرق مختلفة او طريقتها الخاصة ونستخدم الوراثة و اعادة تعريف الدالة override 



import 'person.dart';

void main(){
  student hamza =student(name: 'hamza',lastName: 'qusila',age: 16,phone: 772816114);
  print(hamza);
  hamza.sleep();
}