// abstract class هو عبارة عن class يتم تعريفة يحتوي على صفات يمكن من كلاسات اخرى 
// ترث منة وتستخدم دوالة لكن الدوال التي بداخل هذا الكلاس تختلف من ناحية الاستخدام 
// بمعنى لو انشانا كلاس واسميناه anmale وجعلنا بدالة دوال مثل ;()eat وجلنا كلاسات اخر 
// ترث منة لكننا اجبرنا كل كلاس ان يستخدم الدالة على نوع الكلاس الذي ورث 
// ايضا الكلاس من نوع ابستراك كلاس لا يمكن انشاء object منة 
void main(){

}

abstract class anmale{
  eat();
  sleep(){

  }
}
class leon extends anmale{
  @override
  eat(){
    print('leon eatting so strong');
  }
}