// عندما ننشئ كلا ونقةم بانشاء كائن من هذا الكلاس وعندما نكتب اسم الكائن نجد 
// ان هناك عدة دوال متحة للاستخدام للكائن بالرغم اننا لم نقوم بكتابتها وهذا 
// يعني ان كل كللاس يتم انشائة يرث كلاس اسمة object دون ان نقوم نحن بذالك 

// فائدة هذا ان يسمح لنا باعادة استخدام الدزال الخاصة بكلاس ال object باستخدام override@ 

//anonymous object هو كائن يتم انشاءة واستخدامة دون تخزينة في متغير مستقل باسمة 
// وهذا النوع نستخدمة عندما نريد استخدامة مره واحدة فننشاة مباشرة دون متغير 

void main(){
  //useing object 
  cat lolo=cat();
  List<Object> object=[lolo];

  // using anonymous
  car().print1();
}

// هذا الكلاس لشرح ال استخدام الobject 
class cat{

}

// هذا الكلاس لشرح استخدام anonymous
class car{
  print1(){
    print("hi this is for class");
  }
}